{
  "channels": {
    "amount": [
      {
        "value": "CH1",
        "description": "Channel 1"
      },
      {
        "value": "CH2",
        "description": "Channel 2"
      }
    ],
    "attenuation_factors": [
      {
        "value": "1",
        "description": "1X attenuation"
      },
      {
        "value": "10",
        "description": "10X attenuation"
      },
      {
        "value": "20",
        "description": "20X attenuation"
      },
      {
        "value": "50",
        "description": "50X attenuation"
      },
      {
        "value": "100",
        "description": "100X attenuation"
      },
      {
        "value": "500",
        "description": "500X attenuation"
      },
      {
        "value": "1000",
        "description": "1000X attenuation"
      }
    ]
  },
  "timebase": {
    "modes": [
      {
        "value": "XY",
        "description": "XY displays the voltage of channel 1 (horizontal axis) against the voltage of channel 2 (vertical axis). NOTE: Setting the display format to XY turns cursors off. Sending the CURSor:FUNCtion command when the display format is XY causes the oscilloscope to generate event 221 (Settings conflict) and leaves the display in XY format."
      },
      {
        "value": "YT",
        "description": "YT sets the display to vertical values versus time format and is the default mode."
      }
    ]
  },
  "acquisition": {
    "modes": [
      {
        "value": "SAMple",
        "description": "SAMple specifies that the displayed data point value is the first sampled value that was taken during the acquisition interval. The waveform data has 8 bits of precision in all acquisition modes. You can request 16 bit data with a CURVe? query, but the lower-order 8 bits of data will be zero. SAMple is the default mode."
      },
      {
        "value": "PEAKdetect",
        "description": "PEAKdetect specifies the display of the high-low range of the samples taken from a single waveform acquisition. The oscilloscope displays the high-low range as a vertical range that extends from the highest to the lowest value sampled during the acquisition interval. PEAKdetect mode can reveal the presence of aliasing."
      },
      {
        "value": "AVErage",
        "description": "AVErage specifies averaging mode, where the resulting waveform shows an average of SAMple data points from several separate waveform acquisitions. The number of waveform acquisitions that go into making up the average waveform is set or queried using the ACQuire:NUMAVg command."
      }
    ],

    "average_mode_samples_amount": [
      {
        "value": "4",
        "description": "Sets the number of oscilloscope waveform acquisitions that make up an averaged waveform to 4"
      },
      {
        "value": "16",
        "description": "Sets the number of oscilloscope waveform acquisitions that make up an averaged waveform to 16"
      },
      {
        "value": "64",
        "description": "Sets the number of oscilloscope waveform acquisitions that make up an averaged waveform to 64"
      },
      {
        "value": "128",
        "description": "Sets the number of oscilloscope waveform acquisitions that make up an averaged waveform to 128"
      }
    ]
  },
  "trigger": {
    "modes": [
      {
        "value": "AUTO",
        "description": "AUTO generates a trigger if a trigger is not detected within a specific time period. AUTO also enables scan mode for sweep speeds of 100 ms/div and slower."
      },
      {
        "value": "NORMal",
        "description": "NORMal waits for a valid trigger event."
      }
    ],
    "types": [
      {
        "value": "EDGE",
        "description": "EDGE is a normal trigger. A trigger event occurs when a signal passes through a specified voltage level in the specified direction and is controlled by the TRIGger:MAIn:EDGE commands."
      },
      {
        "value": "VIDeo",
        "description": "VIDeo specifies that a trigger occurs when a specified signal is found and is controlled by the TRIGger:MAIn:VIDeo commands."
      },
      {
        "value": "PULse",
        "description": "PULse specifies that a trigger occurs when the specified signal meets the pulse width criteria that is controlled by the TRIGger: MAIn:PULse commands."
      }
    ],
    "edge_types": [
      {
        "value": "FALL",
        "description": "FALL specifies to trigger on the falling or negative edge of a signal."
      },
      {
        "value": "RISe",
        "description": "RISe specifies to trigger on the rising or positive edge of a signal."
      }
    ],
    "edge_sources": [
      {
        "value": "CH1",
        "description": "CH1 specifies channel 1 as source."
      },
      {
        "value": "CH2",
        "description": "CH2 specifies channel 2 as source."
      },
      {
        "value": "EXT",
        "description": "EXT specifies the external input."
      },
      {
        "value": "EXT5",
        "description": "EXT5 specifies that the external input is attenuated by a factor of 5."
      },
      {
        "value": "AC LINE",
        "description": "AC LINE specifies the power line signal as a trigger source."
      }
    ]
  }
}